const fs = global.nodemodule["fs-extra"];
module.exports.config = {
  name: "Jokes",
  version: "1.0.1",
  hasPermssion: 0,
  credits: "uzairrajput",
  description: "aadi bot",
  commandCategory: "Noprefix",
  usages: "noprefix",
  cooldowns: 5,
}
module.exports.handleEvent = async function({ api, event, args, Threads, Users }) {
  var { threadID, messageID, reason } = event;
  const moment = require("moment-timezone");
  const time = moment.tz("Asia/Karachi").format("HH:MM:ss L");
  var idgr = `${event.threadID}`;
  var id = event.senderID;
  var name = await Users.getNameUser(event.senderID);

  var tl = ["پپو - 'میں پھیلنا چاہتا ہوں' دوست - کیوں؟ پپو - پاپا نے کہا ہے کہ اگر میں پہلے آیا تو سائنس، اگر میں دوسرے آیا تو آرٹس، اگر میں اچھا ہوا تو تم سے شادی کروں گا۔" , "دوا اور شراب میں کیا فرق ہے؟ دوا ایک گرل فرینڈ کی طرح ہے جس کی ایکسپائری ڈیٹ آتی ہے لیکن شراب بیوی کی طرح ہوتی ہے، وہ جتنی بڑی ہوتی جاتی ہے، اتنا ہی غصہ آتا ہے۔" , "لڑکیاں - بچپن میں پاپا کا فرشتہ، شادی کے بعد گھر کی رانی - پہلے ماں باپ کی مار کھاتے تھے، شادی کے بعد بیوی۔" , "جیسے جیسے ہندوستان ترقی کر رہا ہے لڑکیوں کی ڈی پی میں چمک بڑھ رہی ہے۔" , "جیسے جیسے سردیاں آرہی ہیں، صبح کے وقت بستر کی کشش ثقل میں بھی اضافہ ہوتا جا رہا ہے، امتحان چاہے کیسے بھی گزرے، جب یہ ختم ہو جائے تو ہمیشہ خوشی کا احساس ہوتا ہے۔ " , "اتوار کو بھی 24 گھنٹے ہوتے ہیں لیکن اگر آپ بے روزگار نہیں ہیں تو آپ کو 12 گھنٹے کی طرح محسوس ہوگا۔ " , "سردی سے نجات کا بہترین نسخہ۔ وہسکی کو گردن پر اندر سے مساج کریں۔" , "جب کوئی خوبصورت لڑکی، بالکل ٹھنڈی ہو کر، آپ کے ساتھ والی سیٹ پر آ کر بیٹھ جائے… تو سمجھ لیں کہ آپ اب جوان نہیں رہے۔" , "یہ ضروری نہیں کہ لڑکا ہر بار فیل ہو رہا ہو انتشار کی وجہ سے... ممکن ہے وہ ڈپٹی سی ایم کی تیاری کر رہا ہو۔" , "میری بیوی مجھے کئی سالوں سے شراب اور سگریٹ چھوڑنے کا کہہ رہی ہے، لیکن ہم ایسا نہیں کر پا رہے… اور کچھ بیوقوف بیوی کے کہنے پر ملک چھوڑنے کے لیے تیار ہو گئے۔" , "سسر: ارے داماد، وہ بھی اچانک کیسے گھر والوں کے ساتھ: اس نے سوچا کہ آج کل سب اپنے ایوارڈ واپس کر رہے ہیں، میں بھی ہوں۔" , "مجھے دنیا کی دو ایسی مخلوقات بتائیں جنہیں سردی نہیں لگتی... 1. پینگوئن اور 2. شادی میں آنے والی عورتیں..." , "محبت وہ ہے جس میں محبت میں ڈوبا لڑکا 100 روپے لینے کے بعد بیئر پینے کے بجائے اپنے سحر کو بانٹنے کے لیے ٹاک ٹائم کا بندوبست کرتا ہے..!" , "کچھ لڑکے پریشان ہیں کہ مودی کوہ نور خریدنے لندن کیوں گئے جبکہ کوہ نور بھارت کے تقریباً تمام میڈیکل اسٹورز پر دستیاب ہے۔" , "آج کل 2G انٹرنیٹ کا کردار رشتوں کو خراب کرنے میں دوری سے زیادہ ہے...!!!" , "پتا نہیں کچھ لڑکے ان بیچاری لڑکیوں سے کیسے ٹوٹ جاتے ہیں، میرے جیسا لڑکا سوچتا ہے، خدارا مجھے سیٹ کر دو، میں سب کچھ سنبھال لوں گا۔" , "میں جب بھی کسی جوڑے کو ہنستے اور باتیں کرتے دیکھتا ہوں تو میرے ذہن میں ایک ہی خیال آتا ہے کہ کیا ان کی بیوی 'نئی' ہے یا 'نہیں'؟" , "کون کہتا ہے کہ دنیا آپ کی پرواہ نہیں کرتی، دن کے وقت ہیڈلائٹس کے ساتھ موٹر سائیکل چلانے کی کوشش کریں... آپ کم از کم 100 لاگ ٹوک حاصل کریں گے...!!!" , "خدا نے ہر انسان کو مختلف بنایا ہے لیکن جب چین کی باری آئی وہ تھک چکا تھا- اور کاپی پیسٹ کاپی پیسٹ کر کے سب سے جان چھڑا لی۔ " , "تین قسم کے لوگ اکثر رات گئے تک جاگتے ہیں۔ 1- دلدار 2- زندہ دل 3- محبت کی تلاش میں۔ میں دن بھر سوتا ہوں، بے روزگاری بھی کوئی چیز ہے۔" , "آج کا ہندی علم: ایئر ہوسٹس = ہوائی بیوٹی نرس = میڈیسن بیوٹی لیڈی ٹیچر = اسٹڈی بیوٹی میڈ = کلیننگ بیوٹی وائف - فائٹنگ بیوٹی" , "عقیدت مند: بابا میری شادی نہیں ہو رہی۔ نرمل بابا: جیب میں کس کی تصویر رکھتے ہو؟ بھکت: نرمل بابا: ڈگ وجے سنگھ کی تصویر اپنی جیب میں رکھو!" , "ہندوستان وہ واحد ملک ہے جہاں گھر سے باہر ہو تو آوارہ اور گھر کے اندر ہو تو نالائق کہلاتا ہے۔"];
  var rand = tl[Math.floor(Math.random() * tl.length)]

    if ((event.body.toLowerCase() == "") || (event.body.toLowerCase() == "") || (event.body.toLowerCase() == "") || (event.body.toLowerCase() == "")) {
     return api.sendMessage("", threadID);
   };

      mess = "{name}"

  if (event.body.includes("JOKE") == 1 ||
   (event.body.includes("Joke") == 1 ||
   (event.body.includes("joke") == 1 ||
   (event.body.includes("#JOKE") == 1 ||
   (event.body.includes("#joke") == 1 ||
   (event.body.includes("#Joke") == 1 ||
   (event.body.includes("funny") == 1 ||
   (event.body.includes("FUNNY") == 1 ||
   (event.body.includes("Funny") == 1 ))))))))) {
    var msg = {
      body: `${name} \n____________________________________\n\n\n${rand}`
    }
    return api.sendMessage(msg, threadID, messageID);
  };

}

module.exports.run = function({ api, event, client, __GLOBAL }) { }
